# ConnectionValidationWarning Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionValidationWarning Class
Members See Also
---
Contains information about a specific connection validation problem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class ConnectionValidationWarning : IDisposable
```

Visual Basic
---
```text
Public Class ConnectionValidationWarning _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ConnectionValidationWarning : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ConnectionValidationWarning
# See Also
ConnectionValidationWarning Members
Autodesk.Revit.DB Namespace